Revit 2026 API

# ParameterFilterRuleFactoryCreateLessRule(ElementId, String) Method

---

Creates a filter rule that determines whether strings from the document are less than a certain value.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static FilterRule CreateLessRule(
	ElementId parameter,
	string value
)
```
```vb
Public Shared Function CreateLessRule (
	parameter As ElementId,
	value As String
) As FilterRule
```
```cpp
public:
static FilterRule^ CreateLessRule(
	ElementId^ parameter,
	String^ value
)
```
```fsharp
static member CreateLessRule :
        parameter : ElementId *
        value : string -> FilterRule
```

#### Parameters

parameter ElementId
     A string-typed parameter used to get values from the document for a given element.
value String
     The user-supplied string value against which values from the document will be compared.

#### Return Value

FilterRule Created filter rule object.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

For strings, a value is "less" than another if it would appear before the other in an alphabetically-sorted list.

#### Reference

ParameterFilterRuleFactory Class

CreateLessRule Overload

Autodesk.Revit.DB Namespace